import React from "react";
import {
    Background_Gray,
  } from "../../styled-component/style";
function Agreement_0() {
  return (
    //전자결제대행 이용 동의
    <Background_Gray>
      제1조 (목적) 이 약관은 이 제공하는 전자지급결제대행서비스를 이용자가
      이용함에 있어 회사와 이용자 사이의 서비스 이용에 관한 기본적인 사항을
      정함을 목적으로 합니다.
      <br />
      <br />
      제2조 (용어의 정의) 이 약관에서 정하는 용어의 정의는 다음 각 호와
      같습니다. '전자금융거래'라 함은 회사가 전자적 장치를 통하여
      전자지급결제대행서비스를 제공하고, 이용자가 회사의 종사자와 직접
      대면하거나 의사소통을 하지 아니하고 자동화된 방식으로 이를 이용하는 거래를
      말합니다. '전자지급결제대행서비스'(이하 '서비스'라 합니다)라 함은 전자적
      방법으로 재화의 구입 또는 용역의 이용에 있어서 지급결제정보를 송신하거나
      수신하는 것 또는 그 대가의 정산을 대행하거나 매개하는 서비스를 말합니다.
      '이용자'라 함은 이 약관에 동의하고 회사가 제공하는 전자지급결제대행
      서비스를 이용하는 자를 말합니다. '접근매체'라 함은 전자금융거래에 있어서
      거래지시를 하거나 이용자 및 거래내용의 진실성과 정확성을 확보하기 위하여
      사용되는 수단 또는 정보로서 전자식 카드 및 이에 준하는 전자적
      정보(신용카드번호를 포함한다), '전자서명법'상의 인증서, 금융기관 또는
      전자금융업자에 등록된 이용자번호, 이용자의 생체정보, 이상의 수단이나
      정보를 사용하는데 필요한 비밀번호 등 전자금융거래법 제2조 제10호에서
      정하고 있는 것을 말합니다. '거래지시'라 함은 이용자가 본 약관에 의하여
      체결되는 전자지급결제대행계약에 따라 회사에 대하여 전자지급결제대행의
      처리를 지시하는 것을 말합니다. '오류'라 함은 이용자의 고의 또는 과실 없이
      전자지급결제대행이 전자지급결제대행계약 또는 이용자의 거래지시에 따라
      이행되지 아니한 경우를 말합니다.
      <br />
      <br />
      제3조 (약관의 명시 및 변경) 회사는 이용자가 전자지급결제대행 서비스를
      이용하기 전에 이 약관을 게시하고 이용자가 이 약관의 중요한 내용을 확인할
      수 있도록 합니다. 회사는 이용자의 요청이 있는 경우 전자문서의 전송방식에
      의하여 본 약관의 사본을 이용자에게 교부합니다. 회사가 이 약관을 변경할
      때에는 시행일 전 1개월간 사이트에 변경내용을 게시하여야 하며, 이용자가
      변경된 약관에 동의하지 않을 경우 서비스 이용을 중단할 수 있습니다.
      <br />
      <br />
      제4조 (서비스의 종류) 회사가 제공하는 서비스는 지급결제수단에 따라 다음 각
      호와 같이 구별됩니다.
      <br />
      <br />
    </Background_Gray>
  );
}

export default Agreement_0;
